       01  SEGA-CUSTOMER-ACCOUNT.
           03 SEGA-ACCOUNT-NUMBER    PIC X(10).
           03 SEGA-CUSTOMER-PHONE-NB PIC X(10).
           03 SEGA-CUSTOMER-NAME     PIC X(30).
           03 SEGA-CUSTOMER-ADDRESS  PIC X(40).