       01  WS-TRAILER-REC.
           05  FILLER                  PIC X(1).
           05  IN-RECORD-COUNT         PIC 9(9).
           05  FILLER                  PIC X(1).
           05  IN-MEDICATION-CHARGES   PIC S9(9)V99.
           05  IN-PHARMACY-CHARGES     PIC S9(7)V99.
           05  IN-ANCILLARY-CHARGES    PIC S9(5)V99.